<title> Learn Variable Chapter 2</title>
<?php 
$age = 135; //<-- เป็นการประกาศตัวแปรแบบกำหนดต่าให้ตัวแปรด้วยในที่นี้คือ 135
$myname = 'Jakrit'; // <-- เป็นการประกาศตัวแปรอย่างเดียวไม่ได้กำหนดค่าของตัวแปร
$product_price = 1875.32; //<-- เป็นการประกาศตัวแปรแบบ เก็บค่าตัวเเปรเป็นทศนิยม
$mystatus = true; //<-- เป็นการเก็บค่าตัวแปรประเภท บูลีน เช่น true,false
$mysurename = null; //<-- เป็นการประกาศตัวแปรเป็นประเภท Null
$total = $age+$product_price;
//การดึงตัวแปรที่ประกาศไว้มาใช้งาน มี 2 วิธี 1.ใช้ "" จะสามารถประกาศตัวแปรข้างใน "" ได้เลย
echo "I'm $myname.<br>";
echo "I'm $age year old.<br>";
echo "$age+$product_price<br>";
echo "$total<br>";
// วิธีที่ 2 การใช้ '' โดยจะใช้แตกต่างจาก "" ต้องมีการใช้ . มาเชื่อมตัวแปรนั่นเอง ดังนี้
echo 'รองเท้าคู่นี้ราคา = ' . $product_price;


?>



<!-- Variavle ตัวแปร จะใช้โดยการมี $ ขึ้นก่อน 
ตามด้วยตัวอักษรภาษาอังกฤษ การตั้งชื่อตัวแปรควรตั้งให้มีความหมายสอดคล้องกับเนื้อหาที่ทำอยู่-->